In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\onwuk\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
df=pd.read_csv('tips.CSV')
df.head()

   total_bill     tip  gender smoker   day    time  size
0     2125.50  360.79    Male     No  Thur   Lunch     1
1     2727.18  259.42  Female     No   Sun  Dinner     5
2     1066.02  274.68  Female    Yes  Thur  Dinner     4
3     3493.45  337.90  Female     No   Sun  Dinner     1
4     3470.56  567.89    Male    Yes   Sun   Lunch     6

In [23]:
df['gender']

0        Male
1      Female
2      Female
3      Female
4        Male
        ...
739      Male
740    Female
741      Male
742      Male
743    Female
Name: gender, Length: 744, dtype: object

In [24]:
df=df.set_index('gender')
df.head()

        total_bill     tip smoker   day    time  size
gender
Male       2125.50  360.79     No  Thur   Lunch     1
Female     2727.18  259.42     No   Sun  Dinner     5
Female     1066.02  274.68    Yes  Thur  Dinner     4
Female     3493.45  337.90     No   Sun  Dinner     1
Male       3470.56  567.89    Yes   Sun   Lunch     6

In [51]:
def mean (total_bill):
      return(float(sum(total_bill)) / len(t))

In [46]:
total_bill=(2125.50+2727.18+1066.02+3493.45+3470.56)

In [52]:
import numpy as np 
np.mean([2125.50,2727.18,1066.02,3493.45,3470.56])

2576.5420000000004

In [54]:
def var(total_bill,mu):
    dev2 =[(x-mu)**2 for x in t ]
    var= mean(dev2)
    return(var)

In [56]:
print(np.var([2125.50,2727.18,1066.02,3493.45,3470.56]))

829559.174016